app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" WHERE "emails"."read" = ?  [["read", 1]]
---
  def index
     @read_emails = Email.where(read: false)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "emails" SET "read" = ?, "updated_at" = ? WHERE "emails"."id" = ?  [["read", 1], ["updated_at", "2018-08-23 23:35:06.210570"], ["id", 12]]
---
   def update
     @email = Email.find(params[:id])
     @email.update_attributes!(allowed_params)

DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 9]]
---
   def destroy
     @email = Email.destroy(params[:id])